# 1.Create two series as shown using pd. series( ) function.  
Series — A = [10, 20, 30, 40, 50]

Series — B = [40, 50, 60, 70, 80]

(i)	Get the items not common to both

In [1]:
import pandas as pd
import numpy as np
series_A=pd.Series([10,20,30,40,50])
series_B=pd.Series([40,50,60,70,80])
union=pd.Series(np.union1d(series_A,series_B))
intersect=pd.Series(np.intersect1d(series_A,series_B))
notcommonseries=union[~union.isin(intersect)]
print(notcommonseries)

0    10
1    20
2    30
5    60
6    70
7    80
dtype: int64

(ii)Identify the smallest and largest element in the Series A.

In [3]:
print('Largest number in series_A is:',series_A.max())
print('Smallest number in series_A is',series_A.min())

Largest number in series_A is: 50
Smallest number in series_A is 10

(iii)Find the sum of Series B.

In [5]:
print('The sum of Series_B is:',series_B.sum())

The sum of Series_B is: 300

(iv)Calculate average in the Series A

In [6]:
print('The average of series_A is:',series_A.mean())

The average of series_A is: 30.0

(v)Find median in the given Series B

In [7]:
print('The median of series_B is:',series_B.median())

The median of series_B is: 60.0

# 2.Create a data frame with the following data.

In [8]:
import pandas as pd
import numpy as np
data={
    'FirstName':['Aryan','Rohan','Riya','Yash','Siddini'],
    'lastname':['Singh','Agarwal','Shah','Bhatia','Khanna'],
    'Type':['Full-time employee','intem','Full-time employee','Part-time employee','Full-time employee'],
    'Department':['Administration','Technical','Administration','Technical','Management'],
    'Yoe':[2,3,5,7,6],
    'Salary':[20000,5000,10000,10000,20000]
    }
df=pd.DataFrame(data)
print(df)

  FirstName lastname                Type      Department  Yoe  Salary
0     Aryan    Singh  Full-time employee  Administration    2   20000
1     Rohan  Agarwal               intem       Technical    3    5000
2      Riya     Shah  Full-time employee  Administration    5   10000
3      Yash   Bhatia  Part-time employee       Technical    7   10000
4   Siddini   Khanna  Full-time employee      Management    6   20000

a) Make a pivot table that shows the average salary of each type of employee for each department.

In [9]:
table=pd.pivot_table(df,index=['Type','Department'],values='Salary',aggfunc='mean')
table

                                   Salary
Type               Department
Full-time employee Administration   15000
                   Management       20000
Part-time employee Technical        10000
intem              Technical         5000

b) Make a pivot table that shows the sum and mean of the salaries of each type of    employee and the number of employees of each type.

In [11]:
pivot=pd.pivot_table(data=df,index='Type',values='Salary',aggfunc=['mean','sum'])
print(pivot)

                            mean    sum
                          Salary Salary
Type
Full-time employee  16666.666667  50000
Part-time employee  10000.000000  10000
intem                5000.000000   5000

In [12]:
df.pivot_table(index='Type',values='Salary',aggfunc='count')

                    Salary
Type
Full-time employee       3
Part-time employee       1
intem                    1

c) Make a pivot table that shows standard deviation for salary column.

In [13]:
df.pivot_table(index='Type',values='Salary',aggfunc='std')

                         Salary
Type
Full-time employee  5773.502692

# 3.Write python code to explain map (), filter (), reduce (), lambda()

Lambda Function

In [14]:
Max = lambda a, b : a if(a > b) else b
Max(4,5)

5

In [15]:
x=lambda a:a+1
print(x(5))

6

In [16]:
x=lambda a,b,c:a+b+c
print(x(5,6,2))

13

Map Function

In [19]:
def add4(x):
    return x+4
list1 = [4,6,7,8,9]
list2 = list(map(add4,list1))
print(list2)

[8, 10, 11, 12, 13]

In [20]:
def starts_with_A(s):
    return s[0]=="A"
fruit=["Apple","banana","pear","Apricot","orange"]
map_object=map(starts_with_A,fruit)
print(list(map_object))

[True, False, False, True, False]

Filter Function

In [21]:
def oddeven(x):
    if x%2 == 0:
        return True
    else:
        return False
list1 = [4,5,6,7,8,9]
evenlist = list(filter(oddeven,list1))
print(evenlist)

[4, 6, 8]

In [22]:
def starts_with_A(s):
    return s[0]=="A"
fruit=["Apple","banana","pear","Apricot","orange"]
filter_object=filter(starts_with_A,fruit)
print(list(filter_object))

['Apple', 'Apricot']

Reduce Function

In [23]:
from functools import reduce
def sum(x,y):
    return x+y
list1 = [6,7,8,9]
s = reduce(sum,list1)
print(s)

30

# 4.Ramesh decides to walk 10000 steps every day to combat the effect that lockdown has had on his body’s agility, mobility, flexibility and strength. Consider the following data from fitness tracker over a period of 10 days.

In [24]:
import pandas as pd
arr={
    'Day_number':[1,2,3,4,5,6,7,8,9,10],
    'Steps_Walked':[4335,9552,7332,4503,5335,7552,8332,6004,8965,7699]
}
df=pd.DataFrame(arr)
print(df)

   Day_number  Steps_Walked
0           1          4335
1           2          9552
2           3          7332
3           4          4503
4           5          5335
5           6          7552
6           7          8332
7           8          6004
8           9          8965
9          10          7699

• Code to add 1000 steps to all the observations.

In [26]:
arr['steps_walked']=df['Steps_Walked']+1000
print(arr['steps_walked'])

0     5335
1    10552
2     8332
3     5503
4     6335
5     8552
6     9332
7     7004
8     9965
9     8699
Name: Steps_Walked, dtype: int64

•	Code to find out the days on which Ramesh walked more than 7000 steps.

In [27]:
days_more_than_7k=df.loc[df['Steps_Walked']>7000]
days_more_than_7k

   Day_number  Steps_Walked
1           2          9552
2           3          7332
5           6          7552
6           7          8332
8           9          8965
9          10          7699

# 5.	Perform the following operations on car manufacturing company dataset auto-mpg. csv. Write code given below in  Pand /numpy.
• Read  data from  auto-mpg.csv

In [29]:
import pandas as pd
df=pd.read_csv("D:\\Dataset\\Auto_mpg.csv.csv")
df

,mpg,Cylinder,Displacement,HP,Weight,Accleartion,Modelyear,Origin,Car-name
0,18,4,300,130,3504,12.0,70,1,Honda
1,15,8,325,165,3645,15.5,71,1,Nexon
2,18,8,318,160,3440,11.0,70,1,Ford
3,16,6,305,160,3450,12.0,75,1,Indica
4,17,8,307,150,3449,10.5,80,1,Swift

•Give code to get all cars with 8 cylinders.

In [30]:
matched=df['Cylinder']==8
new_df=df[matched]
new_df

,mpg,Cylinder,Displacement,HP,Weight,Accleartion,Modelyear,Origin,Car-name
1,15,8,325,165,3645,15.5,71,1,Nexon
2,18,8,318,160,3440,11.0,70,1,Ford
4,17,8,307,150,3449,10.5,80,1,Swift

•Get the number of Cars manufactured in each year

In [31]:
df.groupby(['Modelyear']).count()

,mpg,Cylinder,Displacement,HP,Weight,Accleartion,Origin,Car-name
Modelyear,,,,,,,,
70,2,2,2,2,2,2,2,2
71,1,1,1,1,1,1,1,1
75,1,1,1,1,1,1,1,1
80,1,1,1,1,1,1,1,1